//
//  done.h
//  Algorithm
//
//  Created by mapeng on 2021/10/16.
//

#ifndef done_h
#define done_h

//数组
//M11 盛最多的水的容器
//M15 三数之和
//M34 排序数组查找元素起始位置

//M46 全排列

//链表
//M2 两数相加
//剑指2 22 链表环入口
//E206 反转链表
//M92 反转链表2
//M19 删除链表倒数第n个元素
//M61 旋转链表

//M55 跳跃游戏


//二叉树
//E94 二叉树中序遍历
//M98. 验证二叉搜索树
//M102.二叉树的层序遍历
//M103.二叉树的锯齿遍历
//E144 二叉树前序遍历
//E145 二叉树后序遍历
//M146 LRU
//M148 排序链表
//剑指 07 重建二叉树
//剑指 26 树的子结构
//剑指 36 二叉搜索树与双链表
//剑指 44 二叉树每层最大值
//剑指 II 045. 二叉树最底层最左边的值


//M122 买股票最佳时机2
//M198 打家劫舍

//E704 二分查找
//M739 每日温度
#endif /* done_h */
